<?php
// +-----------------------------------------------------------------------+
// | Piwigo - a PHP based photo gallery                                    |
// +-----------------------------------------------------------------------+
// | Copyright(C) 2008-2013 Piwigo Team                  http://piwigo.org |
// | Copyright(C) 2003-2008 PhpWebGallery Team    http://phpwebgallery.net |
// | Copyright(C) 2002-2003 Pierrick LE GALL   http://le-gall.net/pierrick |
// +-----------------------------------------------------------------------+
// | This program is free software; you can redistribute it and/or modify  |
// | it under the terms of the GNU General Public License as published by  |
// | the Free Software Foundation                                          |
// |                                                                       |
// | This program is distributed in the hope that it will be useful, but   |
// | WITHOUT ANY WARRANTY; without even the implied warranty of            |
// | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU      |
// | General Public License for more details.                              |
// |                                                                       |
// | You should have received a copy of the GNU General Public License     |
// | along with this program; if not, write to the Free Software           |
// | Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, |
// | USA.                                                                  |
// +-----------------------------------------------------------------------+
$lang['PP_Unlock'] = 'Розблоковано';
$lang['PP_PasswordTest'] = 'Розрахунок балів:';
$lang['PP_PwdReset'] = 'Оновлення пароля';
$lang['PP_LockedUsers'] = 'Стан блокування';
$lang['PP_Default user is not unlockable'] = 'За замовчуванням користувач не може бути заблокований і не може бути розблокований';
$lang['PP_User Locked'] = 'Користувач заблокований';
$lang['PP_User Not Locked'] = 'Користувач не заблокований';
$lang['PP_UserLocked_Custom_Txt'] = 'Налаштовування інформаційного повідомлення до заблокованих користувачів';
$lang['PP_Webmaster cannot be pwdreset'] = 'Відновлення пароля не можна настроїти для облікового запису веб-майстрів!';
$lang['PP_Webmaster is not unlockable'] = 'Аккаунт веб-майстрів не може бути заблокований і не може бути розблокований';
$lang['PP_You cannot pwdreset your account'] = 'Відновлення пароля не можна встановити через свій обліковий запис!';
$lang['PP_You cannot unlock your account'] = 'Ви не можете розблокувати свій власний обліковий запис';
$lang['PP_You need to confirm pwdreset'] = 'Необхідно підтвердити пароль відновлення (прапорець)!';
$lang['PP_You need to confirm unlock'] = 'Необхідно підтвердити розблокування (прапорець)!';
$lang['PP_passwtestTitle_d'] = 'Введіть пароль, щоб перевірити і клацніть на &quot;Розрахунок балів&quot; щоб побачити результат.';
$lang['PP_passwtestTitle'] = 'Тестування складності пароля';
$lang['PP_save_config'] = 'Налаштування збережені.';
$lang['PP_submit'] = 'Представити налаштування';
$lang['PP_User_Account_Locked_Txt'] = 'Вибачте, з міркувань безпеки ваш доступ до галереї був заблокований через велику кількість невдалих спроб входу. Це може бути пов’язано з зламом вашого рахунку. Будь ласка, зверніться до адміністратора сайту з проханням розблокувати.';
$lang['PP_Unlock selected users'] = 'Розблокувати обраних користувачів';
$lang['PP_Disable'] = 'Вимкнути (за замовчуванням)';
$lang['PP_Password_Reset_Msg'] = 'Будь ласка, поміняйте свій пароль!';
$lang['PP_PwdReset_Done'] = 'Пароль оновлюється';
$lang['PP_PwdReset_NA'] = 'Оригінальний пароль';
$lang['PP_ScoreTest'] = 'Результат:';
$lang['PP_Enable'] = 'Увімкнути';
$lang['PP_Error_Password_Mandatory'] = 'Безпека: Пароль є обов’язковим!';
$lang['PP_LoginAttempts'] = 'Управління невдалих спроб входу';
$lang['PP_Password reset selected users'] = 'Запитувати пароль відновлення для вибраних користувачів';
$lang['PP_Password_Enforced'] = 'Посилення рівня безпеки паролів';
$lang['PP_Password_Enforced_true'] = 'Увімкнути. Мінімальна оцінка:';
$lang['PP %d user pwdreseted'] = 'Пароль відновлення, необхідний для користувача %d';
$lang['PP %d user unlocked'] = '%d користувач розблокований';
$lang['PP %d users pwdreseted'] = 'Пароль відновлення необхідний користувачам %d';
$lang['PP %d users unlocked'] = '%d користувачі розблоковані';
$lang['PP_AdminPassword_Enforced'] = 'Звернення до адміністраторів';
$lang['PP_Admins cannot be pwdreset'] = 'Відновлення пароля не можна встановити для аккаунта адміністраторів!';
$lang['PP_Pwd_Actions'] = 'Керування користувачами';
$lang['PP_No_Userlist'] = 'Немає користувачів для відображення';
$lang['PP_Admins is not unlockable'] = 'Адміністратори не можуть бути заблоковані, чи розблоковані';
$lang['PP_passwadmTitle_d'] = 'Адміністратор може створити обліковий запис користувача з або без застосування правила обчислювальної складності.<br/><br/>
Примітка: Якщо користувач хоче змінити пароль та зміцнення паролю для користувачів активовано, він підлягатиме під встановленні правила.';
$lang['PP_passwTitle_d'] = 'Вмикання цієї опції робить обов\'язковим встановлення паролю при реєстрації, та потребує відповідність паролю користувача мінімальному рівню складності. Якщо поріг не досягнуто, відображається отриманий бал та потрібний бал складності з рекомендаціями для збільшення балу.<br/><br/>
Цей тест для вимірювання складності паролю, може дозволити отримати уяву про визначення складності паролю.<br/><br/>
Примітка: Бал паролю рахується на базі кількох параметрів: довжина, тип використаних символів (букви, цифри, верхній регістр, нижній регістр, спеціальні символи). Бали до 100 вважаються низькими, від 100 до 500 - середня складність; більше 500 - чудова безпека.';
$lang['PP_config_tab'] = 'Налаштування';
$lang['PP_Users_List_Tab'] = 'Управління';
$lang['PP_UserLocked_Custom_Txt_d'] = 'Тут ви можете змінити текст повідомлення, що відображатиметься користувачеві, чий обліковий запис заблоковано. Для використання різних мов, ви можете скористатися плагіном Extended description якщо він активований.';
$lang['PP_Support_txt'] = 'Офіційна підтримка цього плагіну тільки на сторінці форуму Piwigo:<br/>
<a href="http://piwigo.org/forum/viewtopic.php?id=22863" onclick="window.open(this.href);return false;">English forum - http://piwigo.org/forum/viewtopic.php?id=22863</a>';
$lang['PP_Title'] = 'Password Policy - Версія: ';
$lang['PP_SubTitle'] = 'Налаштування плагіну';
$lang['PP_Select page size'] = 'Виберіть розмір сторінки';
$lang['PP_Select page number'] = 'Виберіть кількість сторінок для відображення';
$lang['PP_Pwd_Actions_d'] = 'Запроси на розблокування облікових записів та відновлення паролю встановлюються тут.<br/><br/>
Оберіть користувачів перед дією. Галочка підтвердження необхідна перед застосуванням будь-якої дії.<br/><br/>
<b style=&quot;color: red;&quot;>Важливо :</b> Виконуйте дії <u><b>ТІЛЬКИ</b> на облікових записах відвідувачів</u>, а не на адміністраторах, webmaster, default та гість.';
$lang['PP_PwdResetTitle_d'] = 'Вмикання цієї опції додє нову функцію на вкладці управління, для відновлення паролю для обраних користувачів. Крім того, додається новий стовпець для відображення статусу паролів для кожного з них з наступними значеннями:<br/><br/>
- Пароль потребує оновлення: Заплановано запит на заміну паролю.<br/>
- Пароль оновлено: Пароль оновлено після запиту.<br/>
- Оригінальний пароль: Оригінальний пароль, обраний при створенні облікового запису і який ніколи не просили відновити.<br/><br/>
<b style=&quot;color: red;&quot;>Webmaster, generic та гість облікові записи виключені з цієї функції.</b><br/><br/>
Ці користувачі будуть автоматично перенаправлятися на свої сторінки налаштування при кожному зі своїх з\'єднань, поки вони не змінять свій пароль і явне повідомлення буде відображено на цій сторінці.';
$lang['PP_PwdReset_Todo'] = 'Пароль потребує оновлення';
$lang['PP_Max number of failed attempts_d'] = 'Число 0 вимикає підрахунок спроб.';
$lang['PP_Max number of failed attempts'] = 'Максимальна кількість невдалих спроб:';
$lang['PP_LoginAttempts_d'] = 'Ця опція дозволяє записувати невдалі спроби входу на галерею в результаті неправильного пароля і автоматично блокувати причетного користувача. Він призначений для протистояти можливим спробам злому з використанням словників паролів.<br/><br/>
<b style=&quot;color: red;&quot;>Webmaster, стандартний і гостьовий облікові записи, виключаються з даної функції.</b><br/><br/>
 При активації, ви зможете вказати максимальну кількість дозволених невдалих спроб перед блокуванням і визначити власне повідомлення користувачу, якого заблоковано. Це повідомлення відображається, тільки якщо користувач успішно увійшов після блокування.<br/><br/>
 Щоб розблокувати облікові записи, перейдіть на вкладку управління. Ви знайдете новий стовпець із зазначенням стану користувачів позначених червоним символом (для заблокованого облікового запису) і зеленим (для розблокованого користувача). Виберіть один або кілька облікових записів, щоб розблокувати і натисніть кнопку розблокування, щоб застосувати дію.';
$lang['PP_Guest is not unlockable'] = 'Гостьові користувачі не можуть бути заблоковані і не можуть бути разблоковані';
$lang['PP_Guest cannot be pwdreset'] = 'Відновлення паролю не може бути встановлено для облікового запису гостя!';
$lang['PP_Generic is not unlockable'] = 'Стандартні користувачі не можуть бути заблоковані і не можуть бути разблоковані';
$lang['PP_Generic cannot be pwdreset'] = 'Відновлення паролю не можна встановити для стандартних облікових записів!';
$lang['PP_Error_Password_Need_Enforcement_%s'] = 'Безпека: Система управління обчислює бал складності на обраний пароль. Складність вашого паролю замала (бал = %s). Будьласка, оберіть новий більш складний пароль, дотримуючись цих правил:<br/>
- Використовуйте букви та цифри<br/>
- Використовуйте верхній та нижній регістри букв<br/>
- Збільшіть довжину (кількість символів)<br/>
Мінімальний бал паролю, що вимагає адміністратор: ';
$lang['PP_Err_Userlist_Settings'] = 'Ця вкладка доступна, тільки якщо оновлення паролю або розблокування облікового запису включено';
$lang['PP_Default user cannot be pwdreset'] = 'Оновлення паролю не може бути встановлено для облікового запису користувача за замовчуванням!';