<?php
// +-----------------------------------------------------------------------+
// | Piwigo - a PHP based photo gallery                                    |
// +-----------------------------------------------------------------------+
// | Copyright(C) 2008-2012 Piwigo Team                  http://piwigo.org |
// | Copyright(C) 2003-2008 PhpWebGallery Team    http://phpwebgallery.net |
// | Copyright(C) 2002-2003 Pierrick LE GALL   http://le-gall.net/pierrick |
// +-----------------------------------------------------------------------+
// | This program is free software; you can redistribute it and/or modify  |
// | it under the terms of the GNU General Public License as published by  |
// | the Free Software Foundation                                          |
// |                                                                       |
// | This program is distributed in the hope that it will be useful, but   |
// | WITHOUT ANY WARRANTY; without even the implied warranty of            |
// | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU      |
// | General Public License for more details.                              |
// |                                                                       |
// | You should have received a copy of the GNU General Public License     |
// | along with this program; if not, write to the Free Software           |
// | Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, |
// | USA.                                                                  |
// +-----------------------------------------------------------------------+
$lang['PP_submit'] = 'Υποβολή ρυθμίσεων';
$lang['PP_save_config'] = 'Η Διαμόρφωση αποθηκεύτηκε.';
$lang['PP_Disable'] = 'Απενεργοποίηση (προεπιλογή)';
$lang['PP_Enable'] = 'Ενεργοποίηση';
$lang['PP_Support_txt'] = 'Η επίσημη υποστήριξη σε αυτό το πρόσθετο είναι μόνο σε αυτά τα θέμα φόρουμ του Piwigo:<br>
<a href="http://piwigo.org/forum/viewtopic.php?id=" onclick="window.open(this.href);return false;">English forum - http://piwigo.org/forum/viewtopic.php?id=</a>';
$lang['PP_PasswordTest'] = 'Δοκιμή Κωδικού:';
$lang['PP_ScoreTest'] = 'Αποτέλεσμα:';
$lang['PP_Error_Password_Mandatory'] = 'Ασφάλεια: Κωδικός Πρόσβασης δεν είναι υποχρεωτικός!';
$lang['PP_Error_Password_Need_Enforcement_%s'] = 'Ασφάλεια: Ένα σύστημα ελέγχου υπολογίζει τη βαθμολογία για την πολυπλοκότητα των επιλεγμένων κωδικών πρόσβασης. Η πολυπλοκότητα του κωδικού πρόσβασής σας είναι πολύ χαμηλή (βαθμολογία = %s). Παρακαλώ, επιλέξτε έναν νέο κωδικό πρόσβασης πιο ασφαλή, ακολουθώντας αυτούς τους κανόνες:<br>
- Χρησιμοποιήστε γράμματα και αριθμούς<br>
- Χρησιμοποιήστε κεφαλαία και πεζά<br>
- Αυξήστε το μήκους του (αριθμός χαρακτήρων)<br>
Η ελάχιστη βαθμολογία για τους κωδικούς πρόσβασης που απαιτείται από τον διαχειριστή είναι:';
$lang['PP_Password_Enforced'] = 'Ενίσχυση του επιπέδου ασφάλειας των κωδικών πρόσβασης';
$lang['PP_Password_Enforced_true'] = 'Ενεργοποίηση. Ελάχιστη βαθμολογία:';
$lang['PP_AdminPassword_Enforced'] = 'Εφαρμόζετε στους διαχειριστές';
$lang['PP_Password_Reset_Msg'] = 'Παρακαλώ, αλλάξτε τον κωδικό σας!';
$lang['PP_PwdReset'] = 'Ανανέωση κωδικού';
$lang['PP_Password reset selected users'] = 'Αίτηση ανανέωσης κωδικού πρόσβασης για επιλεγμένους χρήστες';
$lang['PP_Guest cannot be pwdreset'] = 'Ανανέωση κωδικού δεν μπορεί να γίνει για λογαριασμό επισκεπτών!';
$lang['PP_Default user cannot be pwdreset'] = 'Η ανανέωση κωδικού δεν μπορεί να γίνει για το λογαριασμό του προεπιλεγμένου χρήστη!';
$lang['PP_Webmaster cannot be pwdreset'] = 'Ο κωδικός ανανέωση δεν μπορεί να ρυθμιστεί για το λογαριασμό webmaster!';
$lang['PP_Generic cannot be pwdreset'] = 'Η ανανέωση κωδικού δεν μπορεί να ρυθμιστεί για γενικούς λογαριασμούς!';
$lang['PP_Admins cannot be pwdreset'] = 'Δεν μπορεί να εφαρμοστεί ανανέωση κωδικού πρόσβασης για λογαριασμούς διαχειριστών';
$lang['PP_You cannot pwdreset your account'] = 'Κωδικός ανανέωση δεν μπορεί να ρυθμιστεί για το δικό σας λογαριασμό!';
$lang['PP_You need to confirm pwdreset'] = 'Πρέπει να επιβεβαιώσετε τον κωδικό ανανέωσης (check box)!';
$lang['PP_PwdReset_Todo'] = 'Κωδικός που πρέπει να ανανεωθεί';
$lang['PP_PwdReset_Done'] = 'Κωδικός ανανεώθηκε ';
$lang['PP_PwdReset_NA'] = 'Αρχικός κωδικός πρόσβασης';
$lang['PP %d user pwdreseted'] = 'Ανανέωση κωδικού πρόσβασης απαιτείται για του χρήστη %d';
$lang['PP %d users pwdreseted'] = 'Ανανέωση κωδικού πρόσβασης απαιτείται για τους χρήστες %d';
$lang['PP_passwtestTitle'] = 'Έλεγχος της πολυπλοκότητας ενός κωδικού πρόσβασης';
$lang['PP_passwtestTitle_d'] = 'Εισάγετε τον κωδικό πρόσβασης για τη δοκιμή και στη συνέχεια κάντε κλικ στο &quot;Υπολογισμός Αποτελέσματος&quot; για να δείτε το αποτέλεσμα.
';
$lang['PP_passwTitle_d'] = 'Ενεργοποιώντας αυτή την επιλογή καθιστά υποχρεωτική την κατοχύρωση ενός κωδικού πρόσβασης κατά την εγγραφή, και απαιτεί ο κωδικός πρόσβασης που επέλεγει από τον επισκέπτη να έχει ένα ελάχιστο επίπεδο πολυπλοκότητας. Εάν το όριο δεν επιτυγχάνεται, η βαθμολογία που επιτεύχθηκε και η ελάχιστη βαθμολογία που πρέπει να επιτευχθεί εμφανίζονται, μαζί με συστάσεις για την αύξηση της τιμής των εν λόγω αποτελεσμάτων.<br><br>
Υπάρχει ένα πεδίο δοκιμής για τη μέτρηση της πολυπλοκότητας ενός κωδικού πρόσβασης, και μπορείτε να πάρετε μια ιδέα από το σκορ για τον καθορισμό πολύπλοκων συνδιασμών.<br><br>
Σημείωση: Το σκορ του κωδικού πρόσβασης υπολογίζεται με βάση διάφορες παραμέτρους: το μήκος, το είδος των χαρακτήρων που χρησιμοποιούνται (γράμματα, ψηφία, κεφαλαία, πεζά, ειδικούς χαρακτήρες). Το σκορ κάτω από 100 θεωρείται χαμηλό, από 100 έως 500, η πολυπλοκότητα είναι μέσαία. Πέραν των 500, η ασφάλεια είναι εξαιρετική.';
$lang['PP_passwadmTitle_d'] = 'Ένας διαχειριστής μπορεί να δημιουργήσει ένα λογαριασμό χρήστη με ή χωρίς την εφαρμογή του κανόνα της πολυπλοκότητας των υπολογισμών.<br><br>
Σημείωση: Εάν ο λογαριασμός χρήστη που δημιουργήθηκε θέλει να αλλάξετε τον κωδικό πρόσβασης και οι ενίσχυμένοι κωδικοί πρόσβασης για τους χρήστες είναι ενεργή, θα υπόκειται στο σύνολο των κανόνων.
';
$lang['PP_PwdResetTitle_d'] = 'Η ενεργοποίηση αυτής της επιλογής θα προσθέσει ένα νέο χαρακτηριστικό στον πίνακα διαχείρισης των χρηστών του Piwigo (Χρήστες> Διαχείριση) που μπορεί να εφαρμοστεί για να ανανεώνει τον κωδικό πρόσβασης για επιλεγμένους χρήστες. Επιπλέον, μια νέα στήλη προστίθεται για να δείξει την κατάσταση των κωδικών πρόσβασης για καθένα από αυτούς με τις ακόλουθες τιμές:<br>
- Κωδικός που πρέπει να ανανεωθεί: Μια αίτηση ανανέωσης κωδικού πρόσβασης έχει προγραμματιστεί.<br>
- Κωδικός έχει ανανεωθεί: Ο κωδικός πρόσβασης έχει ανανεωθεί κατόπιν αιτήματος.<br>
- Αρχική Κωδικός: Ο αρχικός κωδικός που επιλέχτηκε κατά τη δημιουργία λογαριασμού και δεν έχει απαιτηθεί μια ανανέωση..<br>
Ο Webmaster, οι γενικοί λογαριασμοί και οι λογαριασμοί επισκεπτώνπου εξαιρούνται από αυτή τη λειτουργία.<br>
Αυτοί οι χρήστες θα μεταφερθούν αυτόματα στη σελίδα προσαρμογής τους σε κάθε μία από τις συνδέσεις τους μέχρι να αλλάξουν τον κωδικό πρόσβασής τους και ένα επεξηγηματικό μήνυμα θα εμφανίζεται σε αυτή τη σελίδα.';
$lang['PP_LoginAttempts'] = 'Διαχείριση αποτυχημένων προσπαθειών σύνδεσης';
$lang['PP_LockedUsers'] = 'Κατάσταση Κλειδώματος';
$lang['PP_Guest is not unlockable'] = 'Οι Επισκέπτες δεν μπορούν να κλειδώνοται και δεν μπορούν να ξεκλειδώνοται';
$lang['PP_Generic is not unlockable'] = 'Κοινοί χρήστες δεν μπορούν να κλειδώνοται και δεν μπορούν να ξεκλειδώνοται';
$lang['PP_Default user is not unlockable'] = 'Ο προεπιλεγμένος χρήστης δεν μπορεί να κλειδωθεί και δεν μπορεί να ξεκλειδωθεί';
$lang['PP_Admins is not unlockable'] = 'Οι Διαχειριστής χρήστες δεν μπορούν να κλειδώνοται και δεν μπορούν να ξεκλειδωθούν';
$lang['PP %d users unlocked'] = '%d χρήστες ξεκλειδώθηκαν';
$lang['PP %d user unlocked'] = '%d χρήστης ξεκλειδώθηκε';
$lang['PP_You need to confirm unlock'] = 'Θα πρέπει να επιβεβαιώσετε το ξεκλείδωμα (check box)!';
$lang['PP_You cannot unlock your account'] = 'Δεν μπορείτε να ξεκλειδώσετε το δικό σας λογαριασμό';
$lang['PP_Webmaster is not unlockable'] = 'Οι χρήστες Webmaster δεν μπορούν να κλειδώνονται και δεν μπορεί να ξεκλειδώνονται';
$lang['PP_User_Account_Locked_Txt'] = 'Δυστυχώς, για λόγους ασφαλείας η πρόσβασή σας στην γκαλερί έχει κλειδωθεί λόγω των πάρα πολλών αποτυχημένων προσπαθειών σύνδεσης. Αυτό μπορεί να οφείλεται και σε μια προσπάθεια hacking στο λογαριασμό σας. Παρακαλούμε επικοινωνήστε με το διαχειριστή του site για να ζητήσετε το ξεκλείδωμα.';
$lang['PP_UserLocked_Custom_Txt_d'] = 'Εδώ μπορείτε να αλλάξετε το κείμενο του μηνύματος που εμφανίζεται στο χρήστη του οποίου ο λογαριασμός έχει κλειδωθεί. Για να χρησιμοποιήσετε πολλές γλώσσες, μπορείτε να χρησιμοποιήσετε ετικέτες του πρόσθετου Extended description, εάν είναι ενεργοποιημένο.';
$lang['PP_UserLocked_Custom_Txt'] = 'Προσαρμογή του μηνύματος πληροφοριών στον κλειδωμένο χρήστη';
$lang['PP_User Locked'] = 'Ο Χρήστης είναι Κλειδωμένος ';
$lang['PP_User Not Locked'] = 'Ο Χρήστης δεν είναι Κλειδωμένος ';
$lang['PP_Unlock selected users'] = 'Ξεκλειδώστε τους επιλεγμένους χρήστες';
$lang['PP_Unlock'] = 'Ξεκλείδωμα';
$lang['PP_Title'] = 'Password Policy - Έκδοση:';
$lang['PP_SubTitle'] = 'Διαμόρφωση πρόσθετου';
$lang['PP_Max number of failed attempts_d'] = 'Ο αριθμός 0 απενεργοποιεί τις καταμετρημένες προσπάθειες.';
$lang['PP_Max number of failed attempts'] = 'Μέγιστος αριθμός αποτυχημένων προσπαθειών:';
$lang['PP_LoginAttempts_d'] = 'Αυτή η επιλογή επιτρέπει την καταγραφή των αποτυχημένων προσπαθειών σύνδεσης στη γκαλερί λόγω εσφαλμένου κωδικού και κλειδώνει αυτόματα το σχετικό λογαριασμό χρήστη. Έχει σχεδιαστεί για να αντιμετωπιστούν πιθανές απόπειρες πειρατείας με τη χρήση λεξικών κωδικού πρόσβασης. <br/> <br/>
<b style=&quot;color: red;&quot;>Οι λογαριασμοί Webmaster, κοινοί χρήστες και επισκέπτες εξαιρούνται από αυτή τη λειτουργία.</b><br/><br/>
Με την ενεργοποίηση, θα είστε σε θέση να καθορίσετε το μέγιστο αριθμό των αποτυχημένων προσπαθειών επιτρέπεται πριν από την ασφάλιση και να ορίσετε ένα προσαρμοσμένο μήνυμα στο χρήστη που έχει κλειδωθεί ο λογαριασμός του. Αυτό το μήνυμα εμφανίζεται μόνο εάν ο χρήστης καταφέρνει να αναγνωριστεί μετά το κλείδωμα. <br/> <br/>
Για να ξεκλειδώσετε τους λογαριασμούς, μεταβείτε στο περιβάλλον διαχείρισης χρηστών της γκαλερί σας. Θα βρείτε μια νέα στήλη που δείχνει την κατάσταση των λογαριασμών που συμβολίζεται από ένα κόκκινο σύμβολο (για το κλειδωμένο λογαριασμό) και πράσινο (για ξεκλειδωμένους λογαριασμό). Επιλέξτε έναν ή περισσότερους λογαριασμούς για να ξεκλειδώσετε και χρησιμοποιήστε το πλήκτρο ξεκλειδώματος που έχει σχεδιαστεί για το σκοπό αυτό.';
$lang['PP_config_tab'] = 'Διαμόρφωση';
$lang['PP_Users_List_Tab'] = 'Διαχείριση';
$lang['PP_Select page size'] = 'Επιλέξτε μέγεθος σελίδας';
$lang['PP_Select page number'] = 'Επιλέξτε τον αριθμό σελίδας για να εμφανίζετε';
$lang['PP_Pwd_Actions_d'] = 'Το Ξεκλείδωμα των λογαριασμών και των αιτημάτων για ανανέωση κωδικού πρόσβασης μπορεί να οριστεί εδώ.<br/><br/>
Επιλέξτε τους χρήστες πριν ορίσετε μια ενέργεια. Η Επιβεβαίωση είναι υποχρεωτική πριν από την εφαρμογή σε οποιαδήποτε ενέργειας.<br/><br/> 
<b style=&quot;color: red;&quot;>Σημαντικό:</b> Ενέργειες που εφαρμόζονται <u><b>ΜΟΝΟ</b> σε λογαριασμούς επισκέπτη</u> και όχι διαχειριστών, webmaster, προεπιλεγμένων και πελατών.';
$lang['PP_Pwd_Actions'] = 'Διαχείρισης χρηστών';
$lang['PP_No_Userlist'] = 'Δεν υπάρχουν διαθέσιμοι χρήστες για εμφάνιση ';
$lang['PP_Err_Userlist_Settings'] = 'Αυτή η καρτέλα είναι διαθέσιμη μόνο αν είναι ενεργοποιημένη η ανανέωση κωδικού πρόσβασης ή ξεκλείδωμα λογαριασμών';
?>